МояКонфа/src/DataProcessors/пр_ИмпортИзSPFоборудования/пр_ИмпортИзSPFоборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пр_ИмпортИзSPFоборудования</name>
</mdclass:DataProcessor>

МояКонфа/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

МояКонфа/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

МояКонфа/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Файлы</types>
    <types>CatalogRef.Партнеры</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    <types>CatalogRef.СтраныМира</types>
    <types>Number</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклоненияПредмета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

МояКонфа/src/DataProcessors/пр_ИмпортИзSPFоборудования/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	 ТзРазниц.Очистить();
	ЗагрузкаНаКлиентеOLE();
	
КонецПроцедуры
  
  
&НаКлиенте
Процедура ЗагрузкаНаКлиентеOLE()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("NAME","Наименование");
	стЗаписываемыеКолонки.Вставить("KKS","Артикул");
	стЗаписываемыеКолонки.Вставить("ED_ISM","ЕдиницаИзмерения");
	стЗаписываемыеКолонки.Вставить("ED_MASSA","ВесЕдиницаИзмерения");
	стЗаписываемыеКолонки.Вставить("MASSA_ALL","ВесЧислитель");
	стЗаписываемыеКолонки.Вставить("KOLVO","ВесЗнаменатель");
	стЗаписываемыеКолонки.Вставить("BLOCK_NUMBER","пр_НомерБлока");
	стЗаписываемыеКолонки.Вставить("TEC","пр_ТехническиеХарактеристики");
	стЗаписываемыеКолонки.Вставить("NOTE","Описание");


	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		строкаШапка = Лист.Cells(2, 1) ;
		
		Для НомерСтроки = 3 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			Для НомерКолонки = 1 По КоличествоКолонок Цикл
				ИмяКолонкиСпр = стЗаписываемыеКолонки.Получить(строкаШапка.Columns(НомерКолонки).value);
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонкиСпр <> Неопределено Тогда
					ДанныеСтроки.Вставить(ИмяКолонкиСпр,  ЗначениеВЯчейке);
				иначе
					попытка
					ДанныеСтроки.Вставить("пр_"+СокрЛП(ИмяКолонкиЕкс),  ЗначениеВЯчейке);
				Исключение
					Сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаписатьНоменклатуру(ДанныеСтроки);
			//Возврат;
		КонецЦикла;	
		Прервать;
	КонецЦикла;
	
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
	Если ТзРазниц.Количество()>0 и ПоказатьИзменение Тогда
		ВывестиОтчет();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиОтчет()
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТзРазниц.Номенклатура КАК Номенклатура,
	               |	ТзРазниц.Реквизит КАК Реквизит,
	               |	ТзРазниц.Было КАК Было,
	               |	ТзРазниц.Стало КАК Стало
	               |ПОМЕСТИТЬ ВТРазниц
	               |ИЗ
	               |	&Тз КАК ТзРазниц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРазниц.Номенклатура КАК Номенклатура,
	               |	ВТРазниц.Реквизит КАК Реквизит,
	               |	ВТРазниц.Было КАК Было,
	               |	ВТРазниц.Стало КАК Стало
	               |ИЗ
	               |	ВТРазниц КАК ВТРазниц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТРазниц.Номенклатура,
	               |	ВТРазниц.Реквизит,
	               |	ВТРазниц.Стало,
	               |	ВТРазниц.Было"; 
	
	Запрос.УстановитьПараметр("Тз", ТзРазниц.Выгрузить()); 
	
	Результат = Запрос.Выполнить(); 
	
	Макет = Обработки.пр_ИмпортИзSPFоборудования.ПолучитьМакет("Макет"); 
	ТабДок = Новый ТабличныйДокумент; 
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
	
	Выборка = Результат.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		ОбластьСтрока.Параметры.Заполнить(Выборка); 
		ТабДок.Вывести(ОбластьСтрока); 
	КонецЦикла;
	ТабДок.Показать("Разница в реквизитах");

КонецПроцедуры


&НаСервере
Процедура ЗаписатьНоменклатуру(ДанныеСтроки)
	
	
	Артикул="";
	АртикулЗаполнен = ДанныеСтроки.Свойство("Артикул",Артикул);	
	Если Не АртикулЗаполнен Тогда Возврат; КонецЕсли;

	ДанныеСтроки.Вставить("ВидНоменклатуры",  Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оборудование"));  
	ДанныеСтроки.Вставить("Родитель",  Справочники.Номенклатура.НайтиПоНаименованию("Оборудование"));
	ДанныеСтроки.Вставить("ТипНоменклатуры",  Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оборудование").ТипНоменклатуры);
	
	Значение="";
	ДанныеСтроки.Свойство("Наименование",Значение);	
	ДанныеСтроки.Вставить("НаименованиеПолное", Значение);
	
	ДанныеСтроки.Свойство("ЕдиницаИзмерения",Значение);
	Значение = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(Значение);
	ДанныеСтроки.Вставить("ЕдиницаИзмерения",Значение);
	
	ДанныеСтроки.Вставить("ВесИспользовать",  Истина);
	ДанныеСтроки.Свойство("ВесЕдиницаИзмерения",Значение);
	Значение = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(Значение);
	ДанныеСтроки.Вставить("ВесЕдиницаИзмерения",Значение);
	ДанныеСтроки.Вставить("Качество",Перечисления.ГрадацииКачества.Новый);
	ДанныеСтроки.Вставить("СтавкаНДС",Перечисления.СтавкиНДС.НДС0);



	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	иначе
		Номенклатура= Номенклатура.Получитьобъект();
	КонецЕсли;
	
	
	Для Каждого ст из ДанныеСтроки Цикл 
		Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти(ст.Ключ)=Неопределено Тогда Продолжить;КонецЕсли;
		Если СокрЛП(Номенклатура[ст.Ключ])<>Лев(СокрЛП(ст.Значение),СтрДлина(СокрЛП(Номенклатура[ст.Ключ]))) Тогда
			строкаТЗ = ТзРазниц.Добавить();
			строкаТЗ.Номенклатура = Номенклатура.Ссылка;
			строкаТЗ.Реквизит = ст.Ключ;
			строкаТЗ.Было = Номенклатура[ст.Ключ];
			строкаТЗ.Стало = ст.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура); 

	
	ЗаполнитьЗначенияСвойств(Номенклатура, ДанныеСтроки);
	//Номенклатура.Наименование = "Удале_"+Номенклатура.Наименование;
	//Номенклатура.Артикул = "Удале_"+Номенклатура.Артикул;
	

	Номенклатура.Записать(); 
					
	Сообщить(СокрЛП(Номенклатура.Артикул)+" - загружен.");
	
КонецПроцедуры



&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx";
	Диалог.МножественныйВыбор=Ложь;
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры



Процедура ЗагрузкаНаКлиентеOLEДоп()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("NAME","Наименование");
	стЗаписываемыеКолонки.Вставить("KKS","Артикул");

	

	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		строкаШапка = Лист.Cells(2, 1) ;
		
		Для НомерСтроки = 3 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			Для НомерКолонки = 1 По КоличествоКолонок Цикл
				ИмяКолонкиСпр = стЗаписываемыеКолонки.Получить(строкаШапка.Columns(НомерКолонки).value);
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонкиСпр <> Неопределено Тогда
					ДанныеСтроки.Вставить(ИмяКолонкиСпр,  ЗначениеВЯчейке);
					ДанныеСтроки.Вставить(СокрЛП(ИмяКолонкиЕкс),  ЗначениеВЯчейке);
				иначе
					попытка
					ДанныеСтроки.Вставить(СокрЛП(ИмяКолонкиЕкс),  ЗначениеВЯчейке);
				Исключение
					Сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаписатьНоменклатуруДопРекв(ДанныеСтроки);
			//Возврат;
		КонецЦикла;	
		Прервать;
	КонецЦикла;
	
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
КонецПроцедуры

&НаСервере
Функция ПоискЗначенияПоКлючу(ст, Ключ, ДляСоответствия=Ложь)
		Если ДляСоответствия Тогда
			Возврат ст[Ключ];
		Иначе
			ЗначениеПоиска = Неопределено;
			ст.Свойство(Ключ,ЗначениеПоиска);
			Возврат ЗначениеПоиска;
		КонецЕсли;
КонецФункции 
		
&НаСервере
Процедура ЗаписатьНоменклатуруДопРекв(ДанныеСтроки)
	  	Артикул="";
	АртикулЗаполнен = ДанныеСтроки.Свойство("Артикул",Артикул);	
	Если Не АртикулЗаполнен Тогда Возврат; КонецЕсли;
	Наименование="";
	ДанныеСтроки.Свойство("Наименование",Наименование);	
	
	
	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	иначе
		Номенклатура= Номенклатура.Получитьобъект();
	КонецЕсли;
	
	Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура); 

	//ЗаполнитьЗначенияСвойств(Номенклатура, ДанныеСтроки);
	//Номенклатура.Наименование = "Удале_"+Номенклатура.Наименование;
	//Номенклатура.Артикул = "Удале_"+Номенклатура.Артикул;
	Номенклатура.Артикул = Артикул;	
	Номенклатура.Наименование = Наименование;
	Номенклатура.НаименованиеПолное = Наименование;
	Номенклатура.Записать(); 
	
	для Каждого ст Из ДанныеСтроки Цикл 
		если ст.Ключ = "Артикул" или ст.Ключ = "Наименование" Тогда Продолжить;КонецЕсли;

		СоздатьДопРеквизитНаСервере(ст.Ключ);
		ТаблицаСвойств = Новый ТаблицаЗначений;
		ТаблицаСвойств.Колонки.Добавить("Свойство");
		ТаблицаСвойств.Колонки.Добавить("Значение");
		строкаТС = ТаблицаСвойств.Добавить();
		строкаТС.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ст.Ключ);
		//ЗначениеПоиска = Неопределено;
		//ст.Свойство(Ключ,ЗначениеПоиска);
		строкаТС.Значение = ст.Значение;
	

		УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Номенклатура.Ссылка,ТаблицаСвойств);
		
	КонецЦикла;
	
	
	
	Сообщить(СокрЛП(Номенклатура.Артикул)+" - загружен.");

	
КонецПроцедуры

&НаСервере
Процедура СоздатьДопРеквизитНаСервере(ИмяРеквизита)
	
    //включим константу использования
    Если Не Константы.ИспользоватьДополнительныеРеквизитыИСведения.Получить() Тогда
        Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Истина);
    КонецЕсли;
	
	//попробуем найти реквизит по наименованию
	ДопРеквизитСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяРеквизита);
	Если НЕ ЗначениеЗаполнено(ДопРеквизитСсылка) Тогда
		//если не нашли реквизит - будем его создавать
		ДопРеквизитОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		ДопРеквизитОбъект.Заголовок = ИмяРеквизита;
		ДопРеквизитОбъект.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура;
		ДопРеквизитОбъект.ТипЗначения = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250));
		ДопРеквизитОбъект.Наименование = ДопРеквизитОбъект.Заголовок + " ("+ДопРеквизитОбъект.НаборСвойств+")";
		ДопРеквизитОбъект.Виден = Истина;
		ДопРеквизитОбъект.Доступен = Истина;
		ДопРеквизитОбъект.ДополнительныеЗначенияИспользуются = ложь;
		//зададим имя нового реквизита
		//ДопРеквизитОбъект.Имя = "filap_"+СтрЗаменить(ИмяРеквизита," ","");
		ДопРеквизитОбъект.Записать();
		ДопРеквизитСсылка = ДопРеквизитОбъект.Ссылка;		
	КонецЕсли;
	
    //добавим наш реквизит в набор дополнительных реквизитов 
    НаборДополнительныхРеквизитов = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура.ПолучитьОбъект();
    Если НаборДополнительныхРеквизитов.ДополнительныеРеквизиты.Найти(ДопРеквизитСсылка, "Свойство") = Неопределено Тогда
        //добавим реквизит в набор
        Стр = НаборДополнительныхРеквизитов.ДополнительныеРеквизиты.Добавить();
        Стр.Свойство = ДопРеквизитСсылка;
	НаборДополнительныхРеквизитов.Записать();
    КонецЕсли;
	
КонецПроцедуры
